In [1]:
import pandas as pd

In [29]:
df = pd.read_csv("survey_results_public.csv")

In [16]:
df.columns = [x.lower() for x in df.columns]

In [17]:
df.columns

Index(['respondent', 'mainbranch', 'hobbyist', 'age', 'age1stcode', 'compfreq',
       'comptotal', 'convertedcomp', 'country', 'currencydesc',
       'currencysymbol', 'databasedesirenextyear', 'databaseworkedwith',
       'devtype', 'edlevel', 'employment', 'ethnicity', 'gender', 'jobfactors',
       'jobsat', 'jobseek', 'languagedesirenextyear', 'languageworkedwith',
       'misctechdesirenextyear', 'misctechworkedwith',
       'newcollabtoolsdesirenextyear', 'newcollabtoolsworkedwith', 'newdevops',
       'newdevopsimpt', 'newedimpt', 'newjobhunt', 'newjobhuntresearch',
       'newlearn', 'newofftopic', 'newonboardgood', 'newothercomms',
       'newovertime', 'newpurchaseresearch', 'newpurplelink', 'newsosites',
       'newstuck', 'opsys', 'orgsize', 'platformdesirenextyear',
       'platformworkedwith', 'purchasewhat', 'sexuality', 'soaccount',
       'socomm', 'sopartfreq', 'sovisitfreq', 'surveyease', 'surveylength',
       'trans', 'undergradmajor', 'webframedesirenextyear',
       'webframeworkedwith', 'welcomechange', 'workweekhrs', 'yearscode',
       'yearscodepro'],
      dtype='object')

In [15]:
df.columns = df.columns.str.replace(" ", "_")

In [18]:
df.rename(columns = {"respondent": "Respondent"}, inplace = True)

In [20]:
df.columns

Index(['Respondent', 'mainbranch', 'hobbyist', 'age', 'age1stcode', 'compfreq',
       'comptotal', 'convertedcomp', 'country', 'currencydesc',
       'currencysymbol', 'databasedesirenextyear', 'databaseworkedwith',
       'devtype', 'edlevel', 'employment', 'ethnicity', 'gender', 'jobfactors',
       'jobsat', 'jobseek', 'languagedesirenextyear', 'languageworkedwith',
       'misctechdesirenextyear', 'misctechworkedwith',
       'newcollabtoolsdesirenextyear', 'newcollabtoolsworkedwith', 'newdevops',
       'newdevopsimpt', 'newedimpt', 'newjobhunt', 'newjobhuntresearch',
       'newlearn', 'newofftopic', 'newonboardgood', 'newothercomms',
       'newovertime', 'newpurchaseresearch', 'newpurplelink', 'newsosites',
       'newstuck', 'opsys', 'orgsize', 'platformdesirenextyear',
       'platformworkedwith', 'purchasewhat', 'sexuality', 'soaccount',
       'socomm', 'sopartfreq', 'sovisitfreq', 'surveyease', 'surveylength',
       'trans', 'undergradmajor', 'webframedesirenextyear',
       'webframeworkedwith', 'welcomechange', 'workweekhrs', 'yearscode',
       'yearscodepro'],
      dtype='object')

In [81]:
account = {
    "student_ID": [100, 101, 201, 331],
    "first_name": ["Ayush", "Ryan", "Chisato", "Isabelle"],
    "last_name": ["Adhikari", "Griffin", "Nii", "Bui"],
    "University": ["CSU", "CSU", "CSU", "DU"],
    "Major": ["CIS", "CS", "Piano", "Nutrition"],
    "Salary": [200000, 100000, 50000, 75000],
    "Age": [21, 22, 30, 20],
    "GPA": [4.0, 4.0, 3.5, 3.8],
}

In [110]:
accounts = pd.DataFrame(account)

In [35]:
accounts.loc[1, "GPA"] = 3.75

In [36]:
accounts.loc[1]

student_ID        101
first_name       Ryan
last_name     Griffin
University        CSU
Major              CS
Salary         100000
Age                22
GPA              3.75
Name: 1, dtype: object

In [43]:
accounts.at[1, "student_ID"]

201

In [48]:
filt = (accounts["Salary"] >= 100000)
accounts[filt]

   student_ID first_name last_name University Major  Salary  Age   GPA
0         100      Ayush  Adhikari        CSU   CIS  200000   21  4.00
1         201       Ryan   Griffin        CSU    CS  100000   22  3.75

In [54]:
accounts.set_index("student_ID", inplace = True)

In [61]:
accounts.loc[101] if 101 == True else print("That student_ID does not exist")

That student_ID does not exist

In [83]:
accounts.loc[:]

   student_ID first_name last_name University      Major  Salary  Age  GPA
0         100      Ayush  Adhikari        CSU        CIS  200000   21  4.0
1         101       Ryan   Griffin        CSU         CS  100000   22  4.0
2         201    Chisato       Nii        CSU      Piano   50000   30  3.5
3         331   Isabelle       Bui         DU  Nutrition   75000   20  3.8

In [141]:
#apply
#map
#applymap
#replace

In [89]:
accounts["first_name"].apply(len)

0    5
1    4
2    7
3    8
Name: first_name, dtype: int64

In [106]:
update_lastName = lambda last_name : last_name.lower()

In [108]:
accounts["last_name"] = accounts["last_name"].apply(update_lastName)

In [111]:
accounts

   student_ID first_name last_name University      Major  Salary  Age  GPA
0         100      Ayush  Adhikari        CSU        CIS  200000   21  4.0
1         101       Ryan   Griffin        CSU         CS  100000   22  4.0
2         201    Chisato       Nii        CSU      Piano   50000   30  3.5
3         331   Isabelle       Bui         DU  Nutrition   75000   20  3.8

In [117]:
accounts.apply(len, axis = "columns")

0    8
1    8
2    8
3    8
dtype: int64

In [115]:
len(accounts["last_name"])

4

In [118]:
accounts.shape

(4, 8)

In [127]:
accounts["student_ID"].min()

100

In [129]:
accounts.apply(pd.Series.max)

student_ID       331
first_name      Ryan
last_name        Nii
University        DU
Major          Piano
Salary        200000
Age               30
GPA              4.0
dtype: object

In [145]:
accounts["first_name"].map({"Ayush": "Ass", "Ryan": "Tits"})

0     Ass
1    Tits
2     NaN
3     NaN
Name: first_name, dtype: object

In [148]:
accounts["first_name"].replace({"Ayush": "Ass", "Ryan": "Tits"}, inplace = True)

In [149]:
accounts

   student_ID first_name last_name University      Major  Salary  Age  GPA
0         100        Ass  Adhikari        CSU        CIS  200000   21  4.0
1         101       Tits   Griffin        CSU         CS  100000   22  4.0
2         201    Chisato       Nii        CSU      Piano   50000   30  3.5
3         331   Isabelle       Bui         DU  Nutrition   75000   20  3.8

In [152]:
df.rename(columns = {"ConvertedComp": "Salary"}, inplace = True)

In [153]:
df["Salary"]

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
64456   NaN
64457   NaN
64458   NaN
64459   NaN
64460   NaN
Name: Salary, Length: 64461, dtype: float64